using System;

namespace Constructions
{
    public class Demo
    {
        /* Создать тестовый пример,работающий с созданными классами.
         * Разбить созданные классы (здания, фабричный класс) и тестовый пример в разные исходные файлы. 
         * Разместить классы в одном пространстве имен.
         * Создать сборку (DLL), включающие эти классы. 
         * Подключить сборку к проекту и откомпилировать тестовый пример со сборкой. 
         * Получить исполняемый файл, 
         * проверить с помощью утилиты ILDASM, что тестовый пример ссылается на сборку и не содержит в себе классов здания и Creator.
         */
    }
}
